<?php

return [
    "delayed_bet_sent_too_early" => "이 베팅을 기다려야합니다. 다시 시도하십시오.",
    "expired" => "이 베팅이 만료되면 다시 시도하십시오.",
    "market" => [
        "asian_handicap_on_multiple" => "2 개 이상의 핸디캡 선택으로 여러 개의 내기를 배치 할 수 없습니다.",
        "not_found" => "선택한 시장이 우리 서버에 존재하지 않습니다"
    ],
    "matches" => [
        "invalid_or_not_found" => "선택한 이벤트가 서버에서 찾을 수 없거나 여전히 유효하지 않습니다."
    ],
    "multiple" => [
        "duplicated_event" => "동일한 이벤트에서 2 개 이상의 선택 사항을 여러 번 배치하고 제거하고 다시 시도하십시오.",
        "invalid_count" => "2 개 이상의 이벤트를 선택하여 여러 베팅을하십시오."
    ],
    "no_bets" => "베팅이 없었으며 다시 시도하십시오.",
    "odds" => [
        "changes" => "확률이 변경되었습니다. 변경 사항을 수락해야합니다.",
        "not_found" => "선택한 확률을 서버에서 찾을 수 없습니다",
        "suspended" => "하나 이상의 선택 사항이 현재 일시 중지되어 변경 사항을 수락해야합니다.",
        "unavailable" => "사용할 수없는 선택이 가능합니다. 변경 사항을 수락해야합니다."
    ],
    "profit_over_limit" => "이익 : 이익 : 통화는 우리의 한계가 있습니다 : 제한 : 통화.",
    "stake" => [
        "greater_than_balance" => "이 베팅을 할 수있는 충분한 균형이 없으며 보증금을 제출하고 다시 시도하십시오.",
        "max" => "스테이크 한도는 다음과 같습니다 : 스테이크 : 통화",
        "min" => "최소한의 지분은 다음과 같습니다 : Sake : 통화"
    ],
    "wallet_not_found" => "선택한 지갑을 찾을 수 없습니다",
    "wrong_hash" => "전송 된 선택이 잘못되었습니다. 다시 시도하십시오."
];
