<?php

return [
    "2fa_disable_failed" => "2FA를 비활성화 할 수 없으므로 다시 시도하십시오.",
    "2fa_disabled" => "계정에는 2FA가 비활성화됩니다.",
    "notifications" => [
        "reset" => [
            "action" => "암호를 재설정",
            "expires_in" => "이 암호 재설정 링크는 다음과 같이 만료됩니다 : 카운트 분.",
            "no_further_action" => "암호 재설정을 요청하지 않은 경우 추가 조치가 필요하지 않습니다.",
            "reason" => "계정에 대한 암호 재설정 요청을 받았기 때문에이 이메일을 받고 있습니다.",
            "subject" => "암호 알림 재설정"
        ]
    ],
    "reset" => "비밀번호가 초기화되었습니다!",
    "reset_2fa" => ": 사용자 이름 휴대 전화로 전송 된 6 자리 2FA를 입력하고 새 암호를 설정하십시오.",
    "sent" => "암호 재설정 링크를 전자 메일로 보내주십시오!",
    "throttled" => "다시 시도하기 전에 기다려주십시오.",
    "token" => "이 암호 재설정 토큰이 유효하지 않습니다.",
    "user" => "이메일 주소가있는 사용자를 찾을 수 없습니다."
];
