<?php

return [
    "accepted" => "다음 : 속성을 수락해야합니다.",
    "active_url" => "다음은 유효한 URL이 아닙니다.",
    "after" => "the : 속성은 다음 날짜이어야합니다. 날짜.",
    "after_or_equal" => "the : 속성은 다음과 같은 날짜이거나 날짜이거나 같아야합니다.",
    "alpha" => "다음과 같이 : 속성에는 문자가 포함될 수 있습니다.",
    "alpha_dash" => "the : 속성에는 문자, 숫자, 대시 및 밑줄 만 포함될 수 있습니다.",
    "alpha_num" => "the : 속성에는 문자와 숫자 만 포함될 수 있습니다.",
    "array" => "the : 속성은 배열이어야합니다.",
    "base64_image" => "제공된 이미지는 다음과 같은 유효한 Base64 이미지 여야합니다.",
    "before" => "다음은 속성이 이전 날짜이어야합니다. 날짜.",
    "before_or_equal" => "the : 속성은 다음과 같거나 같거나 같아야합니다.",
    "between" => [
        "array" => "다음은 다음과 같아야합니다. min and : max 항목 사이에 있어야합니다.",
        "file" => "다음은 다음과 같습니다. min and : Max Kilobytes 사이에 있어야합니다.",
        "numeric" => "다음은 속성이 다음과 같아야합니다. min and : max.",
        "string" => "다음은 속성이 다음과 같아야합니다. min and : max 문자 사이 여야합니다."
    ],
    "boolean" => "the : 속성 필드는 true 또는 false 여야합니다.",
    "confirmed" => ": 속성 확인이 일치하지 않습니다.",
    "custom" => [
        "password" => [
            "lowercase" => "암호에는 적어도 하나의 소문자가 포함되어야합니다",
            "matches_username" => "암호는 사용자 이름과 비슷하지 않아야합니다.",
            "number" => "암호에는 적어도 하나의 숫자가 포함되어야합니다",
            "uppercase" => "암호에는 적어도 하나의 대문자가 포함되어야합니다"
        ]
    ],
    "date" => "다음은 유효한 날짜가 아닙니다.",
    "date_equals" => "the : 속성은 다음과 같은 날짜 여야합니다. 날짜이어야합니다.",
    "date_format" => "the : 속성이 형식 : 형식과 일치하지 않습니다.",
    "different" => "the : 속성 및 다른 : 기타는 다릅니다.",
    "digits" => "the : 속성은 다음과 같아야합니다 : 숫자 숫자입니다.",
    "digits_between" => "the : 속성은 분과 : 최대 숫자 사이에 있어야합니다.",
    "dimensions" => "the : 속성에는 유효하지 않은 이미지 크기가 있습니다.",
    "distinct" => "the : 속성 필드에는 중복 값이 ​​있습니다.",
    "email" => "다음은 유효한 이메일 주소 여야합니다.",
    "ends_with" => "the : 속성은 다음 중 하나로 끝나야합니다. : 값",
    "exists" => "선택한 : 속성이 유효하지 않습니다.",
    "file" => "the : 속성은 파일이어야합니다.",
    "filled" => "the : 속성 필드에는 값이 있어야합니다.",
    "gt" => [
        "array" => "다음 : 속성은 다음과 같아야합니다. 값 항목이 있어야합니다.",
        "file" => "the : 속성은 값 킬로바이트보다 커야합니다.",
        "numeric" => "the : 속성은 다음과 같아야합니다.",
        "string" => "the : 속성은 값 문자보다 크 수 있어야합니다."
    ],
    "gte" => [
        "array" => "the : 속성은 다음과 같아야합니다. 값 항목 이상.",
        "file" => "the : 속성은 킬로바이트 값보다 크거나 같아야합니다.",
        "numeric" => "다음 : 속성은 값보다 크거나 같아야합니다.",
        "string" => "the : 속성은 값보다 크거나 같아야합니다."
    ],
    "image" => "다음은 특성이 이미지 여야합니다.",
    "in" => "선택한 : 속성이 유효하지 않습니다.",
    "in_array" => "다음 : 속성 필드가 다음에 없습니다. 기타.",
    "integer" => "the : 속성은 정수 여야합니다.",
    "ip" => "the : 속성은 유효한 IP 주소 여야합니다.",
    "ipv4" => "the : 속성은 유효한 IPv4 주소 여야합니다.",
    "ipv6" => "the : 속성은 유효한 IPv6 주소 여야합니다.",
    "json" => "the : 속성은 유효한 JSON 문자열이어야합니다.",
    "lt" => [
        "array" => "the : 속성은 값 항목보다 작아야합니다.",
        "file" => "the : 속성은 값 킬로바이트보다 작아야합니다. 킬로바이트.",
        "numeric" => "the : 속성은 값보다 작아야합니다.",
        "string" => "the : 속성은 값 문자보다 작아야합니다."
    ],
    "lte" => [
        "array" => "다음과 같은 속성은 값 항목 이상이해서는 안됩니다.",
        "file" => "특성은 다음과 같아야합니다 : 값 킬로바이트.",
        "numeric" => "the : 속성은 값보다 작거나 같아야합니다.",
        "string" => "the : 속성은 값 문자보다 작거나 같아야합니다."
    ],
    "max" => [
        "array" => "the : 속성은 Max 항목보다 더 많은 것도 없을 수 있습니다.",
        "file" => "the : 속성은 Max Kilobytes보다 크지 않을 수 있습니다.",
        "numeric" => "다음과 같이 : 맥스는 다음과 같지 않을 수 있습니다. max.",
        "string" => "다음은 : 최대 문자보다 크지 않을 수 있습니다."
    ],
    "mimes" => "the : 속성은 유형 : 값의 파일이어야합니다.",
    "mimetypes" => "the : 속성은 유형 : 값의 파일이어야합니다.",
    "min" => [
        "array" => "the : 속성은 적어도 최소한 Min 항목이 있어야합니다.",
        "file" => "the : 속성은 적어도 최소한 킬로바이트 여야합니다.",
        "numeric" => "다음은 속성이 적어도 최소한이어야합니다.",
        "string" => "다음은 속성이 최소한 다음과 같아야합니다."
    ],
    "not_in" => "선택한 : 속성이 유효하지 않습니다.",
    "not_regex" => ": 속성 형식이 유효하지 않습니다.",
    "numeric" => "the : 속성은 숫자 여야합니다.",
    "password" => "암호가 올바르지 않습니다.",
    "present" => ": 속성 필드가 있어야합니다.",
    "regex" => ": 속성 형식이 유효하지 않습니다.",
    "required" => "다음 : 속성 필드가 필요합니다.",
    "required_if" => "다음과 같이 : 기타는 다음과 같습니다. 값입니다.",
    "required_unless" => "다음과 같이 : 기타는 다음과 같지 않으면 속성 필드가 필요합니다.",
    "required_with" => "값 : 값이있는 경우 속성 필드가 필요합니다.",
    "required_with_all" => "값 : 값이있는 경우 속성 필드가 필요합니다.",
    "required_without" => "다음과 같이 : 값이 없을 때 속성 필드가 필요합니다.",
    "required_without_all" => "값 : 값이 없을 때 특성 필드가 필요합니다.",
    "same" => "the : 속성과 다른 : 기타가 일치해야합니다.",
    "size" => [
        "array" => "the : 속성은 다음 항목을 포함해야합니다. 크기 항목.",
        "file" => "the : 속성은 다음과 같아야합니다 : 크기 킬로바이트.",
        "numeric" => "the : 속성은 다음과 같아야합니다. 크기.",
        "string" => "the : 속성은 다음과 같아야합니다 : 크기 문자 여야합니다."
    ],
    "starts_with" => "the : 속성은 다음 중 하나로 시작해야합니다. : 값",
    "string" => "the : 속성은 문자열이어야합니다.",
    "timezone" => "the : 속성은 유효한 영역이어야합니다.",
    "unique" => "다음 : 속성이 이미 촬영되었습니다.",
    "uploaded" => "다음 : 속성을 업로드하지 못했습니다.",
    "url" => ": 속성 형식이 유효하지 않습니다.",
    "uuid" => "the : 속성은 유효한 UUID 여야합니다."
];
