<?php

return [
    "delayed_bet_sent_too_early" => "あなたはこの賭けをするのを待つべきです、もう一度やり直してください。",
    "expired" => "この賭けは期限切れになる、もう一度やり直してください。",
    "market" => [
        "asian_handicap_on_multiple" => "2つ以上のハンディキャップ選択で複数の賭けを入れることはできません。",
        "not_found" => "選択した市場は私たちのサーバーには存在しません"
    ],
    "matches" => [
        "invalid_or_not_found" => "選択されたイベントは私達のサーバー上に見つからなかったか、それでも無効です"
    ],
    "multiple" => [
        "duplicated_event" => "同じイベントから2つ以上の選択肢を持つ複数の選択をしてはいけません。削除してからやり直してください。",
        "invalid_count" => "複数のベットを配置するには、2つ以上のイベントを選択してください。"
    ],
    "no_bets" => "賭けがない、もう一度やり直してください。",
    "odds" => [
        "changes" => "ODDSが変更されましたが、変更を受け入れる必要があります。",
        "not_found" => "選択したオッズは私達のサーバー上に見つかりませんでした",
        "suspended" => "1つ以上の選択が現在中断されていますが、変更を受け入れる必要があります。",
        "unavailable" => "利用できない選択があります、あなたは変更を受け入れるべきです。"
    ],
    "profit_over_limit" => "利益：利益：通貨は私たちの限界を超えています：制限：通貨。",
    "stake" => [
        "greater_than_balance" => "この賭けをするのに十分なバランスがありません、入金してもう一度やり直してください。",
        "max" => "ステークリミットは次のとおりです.STAKE：通貨",
        "min" => "最小のステークは次のとおりです.STAKE：通貨"
    ],
    "wallet_not_found" => "選択した財布は見つかりませんでした",
    "wrong_hash" => "送信された選択は間違っています、もう一度やり直してください。"
];
