<?php

return [
    "2fa_disable_failed" => "2FAを無効にできませんでした、もう一度やり直してください。",
    "2fa_disabled" => "アカウントの2FAは無効になっています。",
    "notifications" => [
        "reset" => [
            "action" => "パスワードを再設定する",
            "expires_in" => "このパスワードのリセットリンクは次の点に期限が切れます。",
            "no_further_action" => "パスワードのリセットを要求しなかった場合は、それ以上の処置は必要ありません。",
            "reason" => "あなたのアカウントのパスワードのリセット要求を受け取ったので、あなたはこのEメールを受け取ります。",
            "subject" => "パスワード通知をリセットします"
        ]
    ],
    "reset" => "あなたのパスワードはリセットされました！",
    "reset_2fa" => "：ユーザー名携帯電話に送信された6桁の2FAを入力して新しいパスワードを設定してください。",
    "sent" => "パスワードのリセットリンクを電子メールで郵送しました。",
    "throttled" => "再試行する前にお待ちください。",
    "token" => "このパスワードリセットトークンは無効です。",
    "user" => "その電子メールアドレスを持つユーザーが見つかりません。"
];
