<?php

return [
    "accepted" => "：属性を受け入れる必要があります。",
    "active_url" => "：属性は有効なURLではありません。",
    "after" => "：属性は、日付の後の日付でなければなりません。",
    "after_or_equal" => "：属性は、日付以降または等しい日付でなければなりません。",
    "alpha" => "：属性には文字を含めることができます。",
    "alpha_dash" => "：属性は、文字、数字、ダッシュ、およびアンダースコアのみを含みます。",
    "alpha_num" => "：属性には文字と数字のみが含まれている場合があります。",
    "array" => "：属性は配列でなければなりません。",
    "base64_image" => "提供されているイメージは、次のものと有効なBase64画像である必要があります。",
    "before" => "：属性は、前日の日付でなければなりません。",
    "before_or_equal" => "：属性は、日付の前後に日付でなければなりません。",
    "between" => [
        "array" => "：属性は、次の間にあります。min and：max項目。",
        "file" => "：属性は、以下の間でなければなりません。",
        "numeric" => "：属性は、次の間でなければなりません。",
        "string" => "：属性は、minと：max文字の間でなければなりません。"
    ],
    "boolean" => "：属性フィールドはtrueまたはfalseでなければなりません。",
    "confirmed" => "：属性確認が一致しません。",
    "custom" => [
        "password" => [
            "lowercase" => "パスワードには少なくとも1つの小文字を含める必要があります",
            "matches_username" => "パスワードはあなたのユーザー名に過ぎるべきではありません",
            "number" => "パスワードには少なくとも1つの数字を含める必要があります",
            "uppercase" => "パスワードには少なくとも1つの大文字を含める必要があります"
        ]
    ],
    "date" => "：属性は有効な日付ではありません。",
    "date_equals" => "：属性は、日付と等しい日付でなければなりません。",
    "date_format" => "：属性は形式：formatと一致しません。",
    "different" => "：属性と：その他は異なる必要があります。",
    "digits" => "：属性は次のものでなければなりません：桁数",
    "digits_between" => "：属性は、以下の間でなければなりません：min and：max桁。",
    "dimensions" => "：属性に無効な画像寸法があります。",
    "distinct" => "：属性フィールドには重複する値があります。",
    "email" => "：属性は有効なEメールアドレスでなければなりません。",
    "ends_with" => "：属性は、次のいずれかで終了する必要があります。",
    "exists" => "選択した：属性が無効です。",
    "file" => "：属性はファイルである必要があります。",
    "filled" => "：属性フィールドに値が必要です。",
    "gt" => [
        "array" => "：属性には、値項目が必要です。",
        "file" => "：属性は、値のkilobytesより大きくなければなりません。",
        "numeric" => "属性は：値より大きくなければなりません。",
        "string" => "：属性は、値の文字より大きくなければなりません。"
    ],
    "gte" => [
        "array" => "：属性には、値項目以上が必要です。",
        "file" => "：属性は、値のキロバイト以上でなければなりません。",
        "numeric" => "：属性は値以上でなければなりません。",
        "string" => "：属性は、値文字以上でなければなりません。"
    ],
    "image" => "：属性は画像でなければなりません。",
    "in" => "選択した：属性が無効です。",
    "in_array" => "：attributeフィールドは：その他には存在しません。",
    "integer" => "：属性は整数でなければなりません。",
    "ip" => "：属性は有効なIPアドレスでなければなりません。",
    "ipv4" => "：属性は有効なIPv4アドレスでなければなりません。",
    "ipv6" => "：属性は有効なIPv6アドレスでなければなりません。",
    "json" => "：属性は有効なJSON文字列でなければなりません。",
    "lt" => [
        "array" => "：属性には、値項目が以下の場合に必要です。",
        "file" => "：属性は以下の場合に必要です。",
        "numeric" => "：属性は以下の値を下回る必要があります。",
        "string" => "：属性は値の文字より小さい必要があります。"
    ],
    "lte" => [
        "array" => "：属性には、以下の値項目が必要ありません。",
        "file" => "：属性は以下の値である必要があります。値キロバイト。",
        "numeric" => "：属性は以下の値以下でなければなりません。",
        "string" => "：属性は、値文字以下でなければなりません。"
    ],
    "max" => [
        "array" => "：属性には、以下の項目以上の項目がありません。",
        "file" => "：属性は、maxキロバイトより大きくないかもしれません。",
        "numeric" => "：属性は以下のものより大きくないかもしれません。",
        "string" => "：属性は、max文字より大きくないかもしれません。"
    ],
    "mimes" => "：属性は、次の型：値のファイルでなければなりません。",
    "mimetypes" => "：属性は、次の型：値のファイルでなければなりません。",
    "min" => [
        "array" => "：属性には、少なくともMIN項目が必要です。",
        "file" => "：属性は少なくともminキロバイトでなければなりません。",
        "numeric" => "属性：属性は少なくともminでなければなりません。",
        "string" => "：属性は少なくともMIN文字でなければなりません。"
    ],
    "not_in" => "選択した：属性が無効です。",
    "not_regex" => "：属性フォーマットが無効です。",
    "numeric" => "：属性は数値でなければなりません。",
    "password" => "パスワードが正しくありません。",
    "present" => "：属性フィールドが存在している必要があります。",
    "regex" => "：属性フォーマットが無効です。",
    "required" => "：属性フィールドが必要です。",
    "required_if" => "：属性フィールドは、次の場合に必要です。",
    "required_unless" => "：属性フィールドは、次の場合を除いて必要でない限り必要です。",
    "required_with" => "値が存在する場合は、属性フィールドが必要です。",
    "required_with_all" => "値が存在する場合は、属性フィールドが必要です。",
    "required_without" => "値が存在しない場合は、：属性フィールドが必要です。",
    "required_without_all" => "値が存在する場合は、属性フィールドが必要です。",
    "same" => "：属性と：その他が一致する必要があります。",
    "size" => [
        "array" => "：属性には、サイズ項目が含まれていなければなりません。",
        "file" => "：属性は次のとおりです。サイズキロバイト。",
        "numeric" => "：属性は以下のものでなければなりません。",
        "string" => "：属性は次のものでなければなりません。"
    ],
    "starts_with" => "：属性は、次のいずれかで始める必要があります。",
    "string" => "：属性は文字列でなければなりません。",
    "timezone" => "：属性は有効なゾーンでなければなりません。",
    "unique" => "：属性はすでに取られています。",
    "uploaded" => "：属性がアップロードできませんでした。",
    "url" => "：属性フォーマットが無効です。",
    "uuid" => "：属性は有効なUUIDでなければなりません。"
];
