<?php

return [
    "accepted" => "：必須接受：屬性。",
    "active_url" => "：屬性不是有效的URL。",
    "after" => "：屬性必須是日期：日期之後。",
    "after_or_equal" => "：屬性必須是或等於：日期的日期。",
    "alpha" => "：屬性只能包含字母。",
    "alpha_dash" => "：屬性只能包含字母，數字，破折號和下劃線。",
    "alpha_num" => "：屬性只能包含字母和數字。",
    "array" => "：屬性必須是數組。",
    "base64_image" => "提供的圖像應該是有效的Base64圖像：尺寸",
    "before" => "：屬性必須是以下日期：日期。",
    "before_or_equal" => "：屬性必須是之前或等於：日期的日期。",
    "between" => [
        "array" => "：屬性必須具有：min和：max項目。",
        "file" => "：屬性必須在：min和：max千字節。",
        "numeric" => "：屬性必須介於：min和：max。",
        "string" => "：屬性必須介於：min和：max字符。"
    ],
    "boolean" => "：屬性字段必須是真或假的。",
    "confirmed" => "：屬性確認不匹配。",
    "custom" => [
        "password" => [
            "lowercase" => "密碼應包括至少一個小寫",
            "matches_username" => "密碼不應該與您的用戶名太相似",
            "number" => "密碼應包括至少一個數字",
            "uppercase" => "密碼應包括至少一個大寫"
        ]
    ],
    "date" => "：屬性不是有效日期。",
    "date_equals" => "：屬性必須是等於：日期的日期。",
    "date_format" => "：屬性與格式不匹配：格式。",
    "different" => "：屬性和：其他必須不同。",
    "digits" => "：屬性必須是：數字數字。",
    "digits_between" => "：屬性必須在：min和：max數字之間。",
    "dimensions" => "：屬性具有無效的圖像尺寸。",
    "distinct" => "：屬性字段具有重複值。",
    "email" => "：屬性必須是有效的電子郵件地址。",
    "ends_with" => "：屬性必須以以下之一結尾：：值",
    "exists" => "所選：屬性無效。",
    "file" => "：屬性必須是文件。",
    "filled" => "：屬性字段必須具有值。",
    "gt" => [
        "array" => "：屬性必須多：價值項目。",
        "file" => "：屬性必須大於：值千字節。",
        "numeric" => "：屬性必須大於：值。",
        "string" => "：屬性必須大於：value字符。"
    ],
    "gte" => [
        "array" => "：屬性必須具有：值項目或更多。",
        "file" => "：屬性必須大於或等於：值千字節。",
        "numeric" => "：屬性必須大於或等於：值。",
        "string" => "：屬性必須大於或等於：值字符。"
    ],
    "image" => "：屬性必須是圖像。",
    "in" => "所選：屬性無效。",
    "in_array" => "：Attribute字段不存在：其他。",
    "integer" => "：屬性必須是整數。",
    "ip" => "：屬性必須是有效的IP地址。",
    "ipv4" => "：屬性必須是有效的IPv4地址。",
    "ipv6" => "：屬性必須是有效的IPv6地址。",
    "json" => "：屬性必須是有效的JSON字符串。",
    "lt" => [
        "array" => "：屬性必須少於：value項。",
        "file" => "：屬性必須小於：值千字節。",
        "numeric" => "：屬性必須小於：值。",
        "string" => "：屬性必須小於：值字符。"
    ],
    "lte" => [
        "array" => "：屬性不得超過：value項。",
        "file" => "：屬性必須小於或等於：值千字節。",
        "numeric" => "：屬性必須小於或等於：值。",
        "string" => "：屬性必須小於或等於：值字符。"
    ],
    "max" => [
        "array" => "：屬性可能沒有超過：最大項目。",
        "file" => "：屬性可能不會大於：最大千字節。",
        "numeric" => "：屬性可能不會大於：最大值。",
        "string" => "：屬性可能不會大於：最大字符。"
    ],
    "mimes" => "：屬性必須是類型的文件：值。",
    "mimetypes" => "：屬性必須是類型的文件：值。",
    "min" => [
        "array" => "：屬性必須至少有：min項目。",
        "file" => "：屬性必須至少：min千字節。",
        "numeric" => "：屬性必須至少：min。",
        "string" => "：屬性必須至少：min字符。"
    ],
    "not_in" => "所選：屬性無效。",
    "not_regex" => "：屬性格式無效。",
    "numeric" => "：屬性必須是數字。",
    "password" => "密碼不正確。",
    "present" => "必須存在：屬性字段。",
    "regex" => "：屬性格式無效。",
    "required" => "：需要屬性字段。",
    "required_if" => "當：其他是：值時，需要：屬性字段。",
    "required_unless" => "否則：否則需要屬性字段，除非：其他位於：值。",
    "required_with" => "當：存在值時，需要：屬性字段。",
    "required_with_all" => "當存在以下值時，需要：屬性字段。",
    "required_without" => "當：不存在值時需要：屬性字段。",
    "required_without_all" => "當缺NONE：存在值時，需要：屬性字段。",
    "same" => "：屬性和：其他必須匹配。",
    "size" => [
        "array" => "：屬性必須包含：大小項目。",
        "file" => "：屬性必須是：大小千字節。",
        "numeric" => "：屬性必須是：大小。",
        "string" => "：屬性必須是：大小字符。"
    ],
    "starts_with" => "：屬性必須以以下之一開頭：：值",
    "string" => "：屬性必須是字符串。",
    "timezone" => "：屬性必須是有效區域。",
    "unique" => "：已經採取了：屬性。",
    "uploaded" => "：屬性未能上傳。",
    "url" => "：屬性格式無效。",
    "uuid" => "：屬性必須是有效的UUID。"
];
