<?php

return [
    "2fa" => [
        "already_enabled" => "2fa पहले से ही आपके खाते में सक्षम है।",
        "create_secret_failed" => "2fa गुप्त कुंजी बनाने में विफल, फिर से प्रयास करें ..",
        "disabled" => "2 एफए आपके खाते के लिए अक्षम है, कृपया इसे लॉगिन करने में सक्षम करें।",
        "enable_failed" => "2FA को सक्षम करने में विफल, पुनः प्रयास करें।",
        "invalid_otp" => "प्रदान किया गया 2 एफए ओटीपी अमान्य या समाप्त हो गया है, फिर से प्रयास करें।",
        "qrcode_failed" => "2 एफए क्यूआरकोड बनाने में विफल, फिर से प्रयास करें।"
    ],
    "failed" => "ये क्रेडेंशियल हमारे रिकॉर्ड से मेल नहीं खाते हैं।",
    "forbidden" => "आपके पास इस संसाधन तक पहुंच नहीं है",
    "notifications" => [
        "changes" => [
            "message" => "हमने आईपी: ipaddress से आपके खाते पर कुछ बदलाव देखा है।",
            "no_further_action" => "यदि आपने इन परिवर्तन किए हैं, तो कोई और कार्रवाई की आवश्यकता नहीं है। हालांकि, अगर आप इन परिवर्तनों को संदिग्ध मानते हैं तो कृपया support@betkudos.io पर तुरंत समर्थन से संपर्क करें",
            "subject" => "हाल ही में आपके खाते में परिवर्तन"
        ]
    ],
    "throttle" => "बहुत सारे लॉगिन प्रयास। कृपया फिर से प्रयास करें: सेकंड सेकंड।"
];
