<?php

return [
    "delayed_bet_sent_too_early" => "आपको इस शर्त को रखने के लिए इंतजार करना चाहिए, कृपया पुनः प्रयास करें।",
    "expired" => "यह शर्त समाप्त हो गई, कृपया पुनः प्रयास करें।",
    "market" => [
        "asian_handicap_on_multiple" => "2 या अधिक विकलांग चयन के साथ एकाधिक शर्त नहीं रख सकते।",
        "not_found" => "चयनित बाजार हमारे सर्वर पर मौजूद नहीं है"
    ],
    "matches" => [
        "invalid_or_not_found" => "चयनित कार्यक्रम हमारे सर्वर पर नहीं मिला था या अभी भी मान्य नहीं है"
    ],
    "multiple" => [
        "duplicated_event" => "आपको एक ही घटना से 2 या अधिक चयन के साथ एक से अधिक नहीं रखना चाहिए, इसे हटा दें और फिर से प्रयास करें।",
        "invalid_count" => "एकाधिक शर्त लगाने के लिए 2 या अधिक घटनाओं का चयन करें।"
    ],
    "no_bets" => "कोई शर्त नहीं रखी, फिर से प्रयास करें।",
    "odds" => [
        "changes" => "बाधाएं बदल गई हैं, आपको परिवर्तनों को स्वीकार करना चाहिए।",
        "not_found" => "चयनित बाधाएं हमारे सर्वर पर नहीं मिलीं",
        "suspended" => "एक या अधिक चयन वर्तमान में निलंबित हैं, आपको परिवर्तनों को स्वीकार करना चाहिए।",
        "unavailable" => "अनुपलब्ध चयन हैं, आपको परिवर्तनों को स्वीकार करना चाहिए।"
    ],
    "profit_over_limit" => "लाभ: लाभ: मुद्रा हमारी सीमा से अधिक है: सीमा: मुद्रा।",
    "stake" => [
        "greater_than_balance" => "आपके पास इस शर्त को रखने के लिए पर्याप्त शेष राशि नहीं है, कृपया जमा करें और पुनः प्रयास करें।",
        "max" => "हिस्सेदारी सीमा है: हिस्सेदारी: मुद्रा",
        "min" => "न्यूनतम हिस्सेदारी है: हिस्सेदारी: मुद्रा"
    ],
    "wallet_not_found" => "आपके द्वारा चुने गए वॉलेट को नहीं मिला",
    "wrong_hash" => "भेजे गए चयन गलत हैं, कृपया पुनः प्रयास करें।"
];
