<?php

return [
    "2fa_disable_failed" => "2FA को अक्षम करने में असमर्थ, कृपया पुनः प्रयास करें।",
    "2fa_disabled" => "2fa आपके खाते के लिए अक्षम है।",
    "notifications" => [
        "reset" => [
            "action" => "पासवर्ड रीसेट",
            "expires_in" => "यह पासवर्ड रीसेट लिंक समाप्त हो जाएगा: गिनती मिनट।",
            "no_further_action" => "यदि आपने पासवर्ड रीसेट का अनुरोध नहीं किया है, तो कोई और कार्रवाई की आवश्यकता नहीं है।",
            "reason" => "आपको यह ईमेल प्राप्त हो रहा है क्योंकि हमें आपके खाते के लिए पासवर्ड रीसेट अनुरोध प्राप्त हुआ है।",
            "subject" => "पासवर्ड अधिसूचना रीसेट करें"
        ]
    ],
    "reset" => "आपका पासवर्ड रिसेट कर दिया गया है!",
    "reset_2fa" => ": उपयोगकर्ता नाम कृपया 6 अंकों 2fa दर्ज करें जो आपके फोन पर भेजा गया था, और एक नया पासवर्ड सेट करें।",
    "sent" => "हमने आपके पासवर्ड रीसेट लिंक को ई-मेल किया है!",
    "throttled" => "कृपया पुनः प्रयास करने से पहले प्रतीक्षा करें।",
    "token" => "यह पासवर्ड रीसेट टोकन अमान्य है।",
    "user" => "हम उस ई-मेल पते के साथ एक उपयोगकर्ता नहीं पा सकते हैं।"
];
