<?php

return [
    "insufficient_funds" => "आपका संतुलन बहुत कम है, कृपया जमा करें और पुनः प्रयास करें।",
    "ip_blocked" => "आईपी ​​पता निलंबित। कृपया ग्राहक सहायता से संपर्क करें।",
    "register" => [
        "failed" => "पंजीकरण करने में विफल, कृपया पुनः प्रयास करें।"
    ],
    "restricted" => "खाता निलंबित। कृपया ग्राहक सहायता से संपर्क करें।",
    "update" => [
        "failed" => "अद्यतन विफल, कृपया पुनः प्रयास करें।",
        "success" => "सभी विवरण अपडेट किए गए हैं"
    ],
    "selfx" => "आपने स्वयं-बहिष्कृत करना चुना है, इसलिए आप वर्तमान में लॉग इन नहीं कर सकते हैं। स्वयं-अबहिष्कृत करने के लिए आपको support@betkudos.com पर ईमेल करना चाहिए"
];
