<?php

return [
    "accepted" => ": विशेषता स्वीकार की जानी चाहिए।",
    "active_url" => ": विशेषता एक मान्य यूआरएल नहीं है।",
    "after" => "द: दिनांक के बाद एक तारीख होनी चाहिए।",
    "after_or_equal" => ": विशेषता के बाद या उसके बराबर होने की तारीख होनी चाहिए: तिथि।",
    "alpha" => ": विशेषता में केवल अक्षर हो सकते हैं।",
    "alpha_dash" => ": विशेषता में केवल अक्षर, संख्याएं, डैश और अंडरस्कोर हो सकते हैं।",
    "alpha_num" => ": विशेषता में केवल अक्षर और संख्या हो सकती है।",
    "array" => ": विशेषता एक सरणी होनी चाहिए।",
    "base64_image" => "प्रदान की गई छवि एक मान्य बेस 64 छवि होनी चाहिए: आयाम",
    "before" => ": विशेषता पहले की तारीख होनी चाहिए: तिथि।",
    "before_or_equal" => ": विशेषता पहले या उसके बराबर एक तारीख होनी चाहिए: तिथि।",
    "between" => [
        "array" => ": विशेषता के बीच होना चाहिए: न्यूनतम और: अधिकतम आइटम।",
        "file" => ": विशेषता के बीच होना चाहिए: न्यूनतम और: अधिकतम किलोबाइट्स।",
        "numeric" => ": विशेषता के बीच होना चाहिए: न्यूनतम और: अधिकतम।",
        "string" => ": विशेषता के बीच होना चाहिए: न्यूनतम और: अधिकतम वर्ण।"
    ],
    "boolean" => ": विशेषता फ़ील्ड सही या गलत होना चाहिए।",
    "confirmed" => ": विशेषता पुष्टिकरण मेल नहीं खाता है।",
    "custom" => [
        "password" => [
            "lowercase" => "पासवर्ड में कम से कम एक लोअरकेस शामिल होना चाहिए",
            "matches_username" => "पासवर्ड आपके उपयोगकर्ता नाम के समान नहीं होना चाहिए",
            "number" => "पासवर्ड में कम से कम एक नंबर शामिल होना चाहिए",
            "uppercase" => "पासवर्ड में कम से कम एक अपरकेस शामिल होना चाहिए"
        ]
    ],
    "date" => ": विशेषता एक वैध तिथि नहीं है।",
    "date_equals" => ": विशेषता एक तारीख के बराबर होना चाहिए: तिथि।",
    "date_format" => ": विशेषता प्रारूप से मेल नहीं खाती है: प्रारूप।",
    "different" => ": विशेषता और: अन्य अलग होना चाहिए।",
    "digits" => ": विशेषता होना चाहिए: अंक अंक।",
    "digits_between" => ": विशेषता के बीच होना चाहिए: न्यूनतम और: अधिकतम अंक।",
    "dimensions" => ": विशेषता में अमान्य छवि आयाम हैं।",
    "distinct" => ": विशेषता फ़ील्ड में डुप्लिकेट मान है।",
    "email" => ": विशेषता एक मान्य ईमेल पता होना चाहिए।",
    "ends_with" => ": विशेषता निम्न में से एक के साथ समाप्त होना चाहिए :: मान",
    "exists" => "चयनित: विशेषता अमान्य है।",
    "file" => ": विशेषता एक फ़ाइल होनी चाहिए।",
    "filled" => ": विशेषता फ़ील्ड का मान होना चाहिए।",
    "gt" => [
        "array" => ": विशेषता से अधिक: मूल्य आइटम से अधिक होना चाहिए।",
        "file" => ": विशेषता किलोबाइट से अधिक होना चाहिए: मूल्य किलोबाइट्स।",
        "numeric" => ": विशेषता: मूल्य से अधिक होनी चाहिए।",
        "string" => ": विशेषता वर्ण से अधिक होना चाहिए: मूल्य वर्ण।"
    ],
    "gte" => [
        "array" => ": विशेषता होनी चाहिए: मूल्य आइटम या अधिक।",
        "file" => ": विशेषता से अधिक या बराबर होना चाहिए: मूल्य किलोबाइट्स।",
        "numeric" => ": विशेषता से अधिक या बराबर होना चाहिए: मूल्य।",
        "string" => ": विशेषता से अधिक या बराबर होना चाहिए: मूल्य वर्ण।"
    ],
    "image" => ": विशेषता एक छवि होनी चाहिए।",
    "in" => "चयनित: विशेषता अमान्य है।",
    "in_array" => ": विशेषता क्षेत्र में मौजूद नहीं है: अन्य।",
    "integer" => ": विशेषता एक पूर्णांक होना चाहिए।",
    "ip" => ": विशेषता मान्य आईपी पता होना चाहिए।",
    "ipv4" => ": विशेषता एक मान्य आईपीवी 4 पता होना चाहिए।",
    "ipv6" => ": विशेषता एक मान्य आईपीवी 6 पता होना चाहिए।",
    "json" => "द: विशेषता एक वैध JSON स्ट्रिंग होना चाहिए।",
    "lt" => [
        "array" => ": विशेषता से कम होना चाहिए: मूल्य आइटम।",
        "file" => ": विशेषता किलोबाइट से कम होना चाहिए: मूल्य किलोबाइट्स।",
        "numeric" => ": विशेषता से कम होना चाहिए: मूल्य।",
        "string" => ": विशेषता वर्णों से कम होना चाहिए: मूल्य वर्ण।"
    ],
    "lte" => [
        "array" => ": विशेषता से अधिक नहीं होना चाहिए: मूल्य आइटम।",
        "file" => ": विशेषता से कम या बराबर होना चाहिए: मूल्य किलोबाइट्स।",
        "numeric" => ": विशेषता से कम या बराबर होना चाहिए: मूल्य।",
        "string" => ": विशेषता से कम या बराबर होना चाहिए: मूल्य वर्ण।"
    ],
    "max" => [
        "array" => ": विशेषता में अधिक जानकारी नहीं हो सकती है: अधिकतम आइटम।",
        "file" => ": विशेषता अधिक नहीं हो सकती है: मैक्स किलोबाइट्स।",
        "numeric" => ": विशेषता: अधिकतम से अधिक नहीं हो सकती है।",
        "string" => ": विशेषता: अधिकतम वर्ण से अधिक नहीं हो सकता है।"
    ],
    "mimes" => ": विशेषता प्रकार की एक फ़ाइल होनी चाहिए: मान।",
    "mimetypes" => ": विशेषता प्रकार की एक फ़ाइल होनी चाहिए: मान।",
    "min" => [
        "array" => ": विशेषता में कम से कम: न्यूनतम आइटम होना चाहिए।",
        "file" => ": विशेषता कम से कम होनी चाहिए: न्यूनतम किलोबाइट्स।",
        "numeric" => ": विशेषता कम से कम होनी चाहिए: न्यूनतम।",
        "string" => ": विशेषता कम से कम होनी चाहिए: न्यूनतम अक्षर।"
    ],
    "not_in" => "चयनित: विशेषता अमान्य है।",
    "not_regex" => ": विशेषता प्रारूप अमान्य है।",
    "numeric" => ": विशेषता एक संख्या होनी चाहिए।",
    "password" => "पासवर्ड गलत है।",
    "present" => ": विशेषता क्षेत्र मौजूद होना चाहिए।",
    "regex" => ": विशेषता प्रारूप अमान्य है।",
    "required" => ": विशेषता क्षेत्र की आवश्यकता है।",
    "required_if" => ": विशेषता फ़ील्ड आवश्यक है जब: अन्य है: मान।",
    "required_unless" => ": विशेषता फ़ील्ड आवश्यक है जब तक कि: अन्य में: मान नहीं है।",
    "required_with" => ": विशेषता फ़ील्ड आवश्यक है जब: मान मौजूद हैं।",
    "required_with_all" => ": विशेषता फ़ील्ड आवश्यक है जब: मान मौजूद हैं।",
    "required_without" => ": विशेषता फ़ील्ड आवश्यक है जब: मान मौजूद नहीं हैं।",
    "required_without_all" => ": विशेषता फ़ील्ड आवश्यक है जब कोई भी: मान मौजूद नहीं है।",
    "same" => "द: विशेषता और: अन्य से मेल खाना चाहिए।",
    "size" => [
        "array" => ": विशेषता में होना चाहिए: आकार आइटम।",
        "file" => ": विशेषता होना चाहिए: आकार किलोबाइट्स।",
        "numeric" => ": विशेषता होना चाहिए: आकार।",
        "string" => ": विशेषता होना चाहिए: आकार वर्ण।"
    ],
    "starts_with" => ": विशेषता निम्न में से किसी एक के साथ शुरू होनी चाहिए: मान",
    "string" => ": विशेषता एक स्ट्रिंग होनी चाहिए।",
    "timezone" => ": विशेषता एक मान्य क्षेत्र होना चाहिए।",
    "unique" => ": विशेषता पहले ही ली जा चुकी है।",
    "uploaded" => ": विशेषता अपलोड करने में विफल रही।",
    "url" => ": विशेषता प्रारूप अमान्य है।",
    "uuid" => ": विशेषता एक वैध यूयूआईडी होना चाहिए।"
];
