<?php

return [
    "2fa" => [
        "already_enabled" => "2FA уже включена в вашу учетную запись.",
        "create_secret_failed" => "Не удалось создать секретный ключ 2FA, попробуйте еще раз ..",
        "disabled" => "2FA отключен для вашей учетной записи, пожалуйста, позволили ему войти в систему.",
        "enable_failed" => "Не удалось включить 2FA, попробуйте еще раз.",
        "invalid_otp" => "При условии, что 2FA OTP недействителен или истек, попробуйте еще раз.",
        "qrcode_failed" => "Не удалось создать 2FA QRCode, попробуйте еще раз."
    ],
    "failed" => "Эти учетные данные не соответствуют нашим записям.",
    "forbidden" => "У вас нет доступа к этому ресурсу",
    "notifications" => [
        "changes" => [
            "message" => "Мы заметили некоторые изменения на вашем аккаунте по IP: iPaddress.",
            "no_further_action" => "Если вы сделали эти изменения, дальнейшее действие не требуется. Однако, если вы считаете, что эти изменения будут подозрительными, пожалуйста, немедленно связаться с поддержкой в ​​Support@betkudos.io",
            "subject" => "Недавно изменяется в вашем аккаунте"
        ]
    ],
    "throttle" => "Слишком много попыток входа в систему. Пожалуйста, попробуйте еще раз в: секунд секунд."
];
