<?php

return [
    "delayed_bet_sent_too_early" => "Вы должны дождаться, чтобы разместить эту ставку, пожалуйста, попробуйте еще раз.",
    "expired" => "Эта ставка истек истек, пожалуйста, попробуйте еще раз.",
    "market" => [
        "asian_handicap_on_multiple" => "Не может разместить несколько ставок с помощью 2 или более вариантов гандикапа.",
        "not_found" => "Выбранный рынок не существует на нашем сервере"
    ],
    "matches" => [
        "invalid_or_not_found" => "Выбранный событие не был найден на нашем сервере или не до сих пор действителен"
    ],
    "multiple" => [
        "duplicated_event" => "Вы не должны размещать несколько с 2 или более выборами из того же события, удалите его и попробуйте снова.",
        "invalid_count" => "Выберите 2 или более событий, чтобы разместить несколько ставок."
    ],
    "no_bets" => "Бетка не было размещено, попробуйте еще раз.",
    "odds" => [
        "changes" => "Шансы изменились, вы должны принять изменения.",
        "not_found" => "Выбранные шансы не были найдены на нашем сервере",
        "suspended" => "Один или несколько выборов в настоящее время приостановлены, вы должны принять изменения.",
        "unavailable" => "Есть недоступные выборы, вы должны принять изменения."
    ],
    "profit_over_limit" => "Прибыль: прибыль: валюта - это наше предел: ограничение: валюта.",
    "stake" => [
        "greater_than_balance" => "У вас недостаточно баланса, чтобы разместить эту ставку, пожалуйста, сделайте депозит и попробуйте снова.",
        "max" => "Лимит доли: доля: валюта",
        "min" => "Минимальная доля: доля: валюта"
    ],
    "wallet_not_found" => "Кошелек, который вы выбрали, не могут быть найдены",
    "wrong_hash" => "Отправления выборов неверны, пожалуйста, попробуйте еще раз."
];
