<?php

return [
    "2fa_disable_failed" => "Невозможно отключить 2FA, пожалуйста, попробуйте еще раз.",
    "2fa_disabled" => "2FA отключен для вашей учетной записи.",
    "notifications" => [
        "reset" => [
            "action" => "Сброс пароля",
            "expires_in" => "Эта ссылка сброса пароля истекает в: считать минуты.",
            "no_further_action" => "Если вы не запрашиваете сброс пароля, дополнительное действие не требуется.",
            "reason" => "Вы получаете это письмо, потому что получим запрос сброса пароля для вашей учетной записи.",
            "subject" => "Сбросить уведомление пароля"
        ]
    ],
    "reset" => "Ваш пароль был сброшен!",
    "reset_2fa" => ": Имя пользователя Пожалуйста, введите 6 цифр 2FA, которая была отправлена ​​на ваш телефон и установить новый пароль.",
    "sent" => "Мы отправили по электронной почте свой ссылку сброса пароля!",
    "throttled" => "Пожалуйста, подождите перед повторной попыткой.",
    "token" => "Этот токен сброса пароля недействителен.",
    "user" => "Мы не можем найти пользователь с этим адресом электронной почты."
];
