<?php

return [
    "insufficient_funds" => "Ваш баланс слишком низкий, пожалуйста, сделайте депозит и попробуйте снова.",
    "ip_blocked" => "IP-адрес приостановлен. Пожалуйста, свяжитесь с поддержкой клиентов.",
    "register" => [
        "failed" => "Не удалось зарегистрироваться, пожалуйста, попробуйте еще раз."
    ],
    "restricted" => "Счет приостановлен. Пожалуйста, свяжитесь с поддержкой клиентов.",
    "update" => [
        "failed" => "Обновление не удалось, пожалуйста, попробуйте еще раз.",
        "success" => "Все детали были обновлены"
    ]
];
