<?php

return [
    "accepted" => "Атрибут: Атрибут должен быть принят.",
    "active_url" => "Атрибут: атрибут не является действительным URL.",
    "after" => "Атрибут: атрибут должен быть датой после: дата.",
    "after_or_equal" => "Атрибут: атрибут должен быть датой после или равна: дата.",
    "alpha" => "Атрибут: атрибут может содержать только буквы.",
    "alpha_dash" => "Атрибут: атрибут может содержать только буквы, цифры, тире и подчеркивания.",
    "alpha_num" => "Атрибут: атрибут может содержать только буквы и цифры.",
    "array" => "Атрибут: атрибут должен быть массивом.",
    "base64_image" => "Представленное изображение должно быть действительным изображением BASE64 с: размерами",
    "before" => "Атрибут: атрибут должен быть датой до: дата.",
    "before_or_equal" => "Атрибут: атрибут должен быть датой до или равна: дата.",
    "between" => [
        "array" => "Атрибут: атрибут должен иметь между: мин и: максимальные элементы.",
        "file" => "Атрибут: атрибут должен быть между: мин и: максимальные килобайты.",
        "numeric" => "Атрибут: атрибут должен быть между: мин и: макс.",
        "string" => "Атрибут: атрибут должен быть между: мин и: max символы."
    ],
    "boolean" => "Поле: атрибут поле должно быть правдой или ложным.",
    "confirmed" => "Подтверждение: атрибут не совпадает.",
    "custom" => [
        "password" => [
            "lowercase" => "Пароль должен включать как минимум один строчный",
            "matches_username" => "Пароль не должен быть слишком похожим на ваше имя пользователя",
            "number" => "Пароль должен включать как минимум один номер",
            "uppercase" => "Пароль должен включать хотя бы один пропис"
        ]
    ],
    "date" => "Атрибут: не допустимая дата.",
    "date_equals" => "Атрибут: атрибут должен быть датой, равной: дата.",
    "date_format" => "Атрибут: атрибут не соответствует формату: формат.",
    "different" => "Атрибут: Другие должны быть разными.",
    "digits" => "Атрибут: атрибут должен быть: цифры цифры.",
    "digits_between" => "Атрибут: атрибут должен быть между: мин и: максимальные цифры.",
    "dimensions" => "Атрибут: атрибут имеет неверные размеры изображения.",
    "distinct" => "Поле: атрибут имеет дублирующее значение.",
    "email" => "Атрибут: атрибут должен быть действительным адресом электронной почты.",
    "ends_with" => "Атрибут: атрибут должен закончиться одним из следующих:: значения",
    "exists" => "Выбранный: атрибут недействителен.",
    "file" => "Атрибут: атрибут должен быть файлом.",
    "filled" => "Поле: атрибут поле должно иметь значение.",
    "gt" => [
        "array" => "Атрибут: атрибут должен иметь больше, чем: стоимость элементов.",
        "file" => "Атрибут: атрибут должен быть больше: значение килобайт.",
        "numeric" => "Атрибут: атрибут должен быть больше: значение.",
        "string" => "Атрибут: атрибут должен быть больше: значение символов."
    ],
    "gte" => [
        "array" => "Атрибут: атрибут должен иметь: значение элементов или более.",
        "file" => "Атрибут: атрибут должен быть больше или равен: значение килобайта.",
        "numeric" => "Атрибут: атрибут должен быть больше или равен: значение.",
        "string" => "Атрибут: атрибут должен быть больше или равен: значение символов."
    ],
    "image" => "Атрибут: атрибут должен быть образ.",
    "in" => "Выбранный: атрибут недействителен.",
    "in_array" => "Поле: Атрибут не существует в: Другое.",
    "integer" => "Атрибут: атрибут должен быть целым числом.",
    "ip" => "Атрибут: атрибут должен быть действительным IP-адресом.",
    "ipv4" => "Атрибут: атрибут должен быть действительным адресом IPv4.",
    "ipv6" => "Атрибут: атрибут должен быть действительным IPv6-адресом.",
    "json" => "Атрибут: атрибут должен быть действительной строкой JSON.",
    "lt" => [
        "array" => "Атрибут: атрибут должен иметь меньше: стоимость элементов.",
        "file" => "Атрибут: атрибут должен быть меньше: значение килобайт.",
        "numeric" => "Атрибут: атрибут должен быть меньше: значение.",
        "string" => "Атрибут: атрибут должен быть меньше: значений символов."
    ],
    "lte" => [
        "array" => "Атрибут: не должен иметь больше, чем: стоимость элементов.",
        "file" => "Атрибут: атрибут должен быть меньше или равен: значение килобайта.",
        "numeric" => "Атрибут: атрибут должен быть меньше или равен: значение.",
        "string" => "Атрибут: Атрибут должен быть меньше или равен: значение символов."
    ],
    "max" => [
        "array" => "Атрибут: атрибут не может быть не более: максимальных элементов.",
        "file" => "Атрибут: атрибут не может быть больше: максимальные килобайты.",
        "numeric" => "Атрибут: атрибут не может быть больше: max.",
        "string" => "Атрибут: атрибут не может быть больше: max символы."
    ],
    "mimes" => "Атрибут: атрибут должен быть файл типа:: значения.",
    "mimetypes" => "Атрибут: атрибут должен быть файл типа:: значения.",
    "min" => [
        "array" => "Атрибут: атрибут должен иметь как минимум: минимальные элементы.",
        "file" => "Атрибут: атрибут должен быть хотя бы: мин килобайты.",
        "numeric" => "Атрибут: атрибут должен быть хотя бы: мин.",
        "string" => "Атрибут: атрибут должен быть как минимум: минимальные символы."
    ],
    "not_in" => "Выбранный: атрибут недействителен.",
    "not_regex" => "Формат: атрибут недействителен.",
    "numeric" => "Атрибут: атрибут должен быть числом.",
    "password" => "Пароль неверен.",
    "present" => "Поле: Атрибут поле должно присутствовать.",
    "regex" => "Формат: атрибут недействителен.",
    "required" => "Поле: атрибут поле требуется.",
    "required_if" => "Поле: атрибут требуется при: другое: значение.",
    "required_unless" => "Поле: Атрибут поле требуется, если: Другое не находится в: значения.",
    "required_with" => "Поле: атрибут поле требуется, когда: значения присутствуют.",
    "required_with_all" => "Поле: атрибут поле требуется, когда: значения присутствуют.",
    "required_without" => "Поле: атрибут поле требуется, когда: значения нет.",
    "required_without_all" => "Поле: атрибут требуется, когда ни одно из: значений не присутствуют.",
    "same" => "Атрибут: атрибут и: другое должно совпадать.",
    "size" => [
        "array" => "Атрибут: Атрибут должен содержать: размер элементов.",
        "file" => "Атрибут: атрибут должен быть: размер килобайт.",
        "numeric" => "Атрибут: атрибут должен быть: размер.",
        "string" => "Атрибут: атрибут должен быть: символы размера."
    ],
    "starts_with" => "Атрибут: Атрибут должен начинаться с одного из следующих:: Значения",
    "string" => "Атрибут: атрибут должен быть строкой.",
    "timezone" => "Атрибут: атрибут должен быть действительной зоной.",
    "unique" => "Атрибут: атрибут уже принят.",
    "uploaded" => "Атрибут: атрибут не удалось загрузить.",
    "url" => "Формат: атрибут недействителен.",
    "uuid" => "Атрибут: атрибут должен быть действительным UUID."
];
